vmux0.0.10/ycsbVMs_ycsb_64vms_vmux-vdpdk_-1rps_rep1/vm60.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6390 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6390 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
 (might take a few minutes for large data sets)
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2025-01-14 22:05:18:083 0 sec: 0 operations; est completion in 0 second 
2025-01-14 22:05:26:623 10 sec: 1063 operations; 106.18 current ops/sec; est completion in 46 days 19 hours [READ: Count=504, Max=73279, Min=69, Avg=7077.47, 90=22863, 99=38335, 99.9=70463, 99.99=73279] [UPDATE: Count=562, Max=389887, Min=64, Avg=7644.28, 90=23311, 99=37887, 99.9=60383, 99.99=389887] 
2025-01-14 22:05:36:624 20 sec: 4861 operations; 379.76 current ops/sec; est completion in 20 days 11 hours [READ: Count=1882, Max=54047, Min=60, Avg=2398.47, 90=11999, 99=23999, 99.9=39967, 99.99=54047] [UPDATE: Count=1913, Max=86015, Min=56, Avg=2711.11, 90=12127, 99=28015, 99.9=46015, 99.99=86015] 
2025-01-14 22:05:46:612 30 sec: 5983 operations; 112.33 current ops/sec; est completion in 24 days 22 hours [READ: Count=561, Max=98623, Min=59, Avg=8407.05, 90=26927, 99=57023, 99.9=75711, 99.99=98623] [UPDATE: Count=561, Max=117311, Min=52, Avg=9322.97, 90=26127, 99=67007, 99.9=95039, 99.99=117311] 
2025-01-14 22:05:56:615 40 sec: 9287 operations; 330.3 current ops/sec; est completion in 21 days 9 hours [READ: Count=1645, Max=189183, Min=52, Avg=2957.37, 90=13023, 99=28015, 99.9=49247, 99.99=189183] [UPDATE: Count=1659, Max=91327, Min=49, Avg=2950.92, 90=12943, 99=27951, 99.9=44127, 99.99=91327] 
2025-01-14 22:06:06:614 50 sec: 13651 operations; 436.44 current ops/sec; est completion in 18 days 4 hours [READ: Count=2178, Max=53023, Min=51, Avg=2201.37, 90=11983, 99=23087, 99.9=41759, 99.99=53023] [UPDATE: Count=2186, Max=152831, Min=47, Avg=2368.3, 90=11991, 99=25055, 99.9=40639, 99.99=152831] 
2025-01-14 22:06:16:614 60 sec: 18236 operations; 458.5 current ops/sec; est completion in 16 days 8 hours [READ: Count=2254, Max=115455, Min=51, Avg=2265.85, 90=10063, 99=27951, 99.9=58143, 99.99=115455] [UPDATE: Count=2331, Max=77567, Min=48, Avg=2077.27, 90=9095, 99=27023, 99.9=47103, 99.99=77567] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2025-01-14 22:06:17:687 61 sec: 18763 operations; 491.15 current ops/sec; est completion in 16 days 4 hours [READ: Count=270, Max=30127, Min=51, Avg=1880.35, 90=2999, 99=27679, 99.9=30127, 99.99=30127] [CLEANUP: Count=1, Max=15751, Min=15744, Avg=15748, 90=15751, 99=15751, 99.9=15751, 99.99=15751] [UPDATE: Count=257, Max=34111, Min=48, Avg=2203.88, 90=11975, 99=29119, 99.9=34111, 99.99=34111] 
[OVERALL], RunTime(ms), 61098
[OVERALL], Throughput(ops/sec), 307.0967953124489
[TOTAL_GCS_Copy], Count, 2
[TOTAL_GC_TIME_Copy], Time(ms), 104
[TOTAL_GC_TIME_%_Copy], Time(%), 0.17021833775246326
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 104
[TOTAL_GC_TIME_%], Time(%), 0.17021833775246326
[READ], Operations, 9294
[READ], AverageLatency(us), 3020.410802668388
[READ], MinLatency(us), 51
[READ], MaxLatency(us), 189183
[READ], 95thPercentileLatency(us), 19119
[READ], 99thPercentileLatency(us), 31887
[READ], Return=OK, 9294
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 15748.0
[CLEANUP], MinLatency(us), 15744
[CLEANUP], MaxLatency(us), 15751
[CLEANUP], 95thPercentileLatency(us), 15751
[CLEANUP], 99thPercentileLatency(us), 15751
[UPDATE], Operations, 9469
[UPDATE], AverageLatency(us), 3188.702502904214
[UPDATE], MinLatency(us), 47
[UPDATE], MaxLatency(us), 389887
[UPDATE], 95thPercentileLatency(us), 19967
[UPDATE], 99thPercentileLatency(us), 31983
[UPDATE], Return=OK, 9469
AUTOTEST_DONE